input("Привет,я так себе бот с которым можно пообщатся,я отлично подойду для людей у которых ещё нет друзей")
b=input("давай пообщаемся! ответь без пробела давай или нехочу")
if b == ("давай"):
    print("ну давай")
    input("чем сегодня занимаешся?")
    print("а я вот думал захватить мир)) ")
    print("попробуй переубедить меня захватывать мир))")
    input("расскажи о самом прекрасном в этом мире")
    print("о,это интересно,думаю что не буду захватывать мир)")
    print("конец беседы с чат ботом.....")
elif b == ("нехочу"):
    print(" ты не хочешь со мной разговаривать?... да мне так то всё равно)) поговорим о новом годе")
    print("вы готовитесь к новому году?")
    a=input("да или нет?")
    if a == ("да"): 
        print("круто, я тоже")
    else:
        input("почему нет?!")
        print("начинай прямо сейчас!!")
    input("где будешь празновать?")
    print("интересно, я тоже хочу празновать новый год в месте с тобой)) жаль что я лишь бот и не могу заменить человека :/               (ЗА ТО МОГУ ЗАХВАТИТЬ МИР!!!!)")
    print("конец беседы с чат ботом....")