input("Привет,я так себе бот с которым можно пообщатся,я отлично подойду для людей у которых ещё нет друзей")
print("прикольно")
b=input("давай пообщаемся! ответь без пробела давай или нехочу")
if b == ("давай"):
    print("ну давай")
    input("чем сегодня занимаешся?")
    print("а я всего лишь бот , поэтому у меня нет дел")
    
elif b == ("нехочу"):
    print(" ты не хочешь со мной разговаривать?... ладно :/")
    print("вы готовитесь к новому году?")
    a=input("да или нет?")
    if a == ("да"): 
        print("круто, я тоже")
    else:
        input("почему нет?!")
        print("начинай прямо сейчас!!")
    input("начал?")
    print("я тебе верю")


















